#+BEGIN_SRC python :session :results output
def add(p1, p2, curve, p):
    """blah"""
    if p1 is None:
        return p2
    if p2 is None:
        return p1
    if (p1[0] == p2[0]) and (p1[1] == (-p2[1]%p)):
        return None
    lam = 0
    if p1 == p2:
        lam = ((3*(p1[0]**2)+curve[0])*inverse_modp(2*p1[1], p)) % p
    else:
        lam = ((p2[1] - p1[1])*inverse_modp(p2[0] - p1[0], p)) % p
    x3 = (lam**2 - p1[0] - p2[0]) % p
    y3 = (lam*(p1[0] - x3) - p1[1]) % p
    return x3, y3
# Denote the point at infinity by 'None'
# a curve is represented by a 2-tuple (a, b)
# for y^2 = x^3 + ax + b
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session
#try example
curve = (3, 8)
p = (9, 7)
q = (1, 8)
add(p, q, curve, 13) # (2, 10)



#+END_SRC

#+RESULTS:
| 2 | 10 |

#+BEGIN_SRC python :session
def ec_exp(pt, n, curve, p):
    q = pt
    r = None
    while n>0:
        if (n % 2) == 1:
            r = add(r, q, curve, p)
        q = add(q, q, curve, p)
        n = n>>1
    return r
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session
n = 947
curve = (14, 19)
p = 3623
pt = (6, 730)
ec_exp(pt, n, curve, p) # (3492, 60)

#+END_SRC

#+RESULTS:
| 3492 | 60 |

#+BEGIN_SRC python :session :results output

#+END_SRC

#+RESULTS:
: 
: >>> >>> >>> (3, 0)

#+BEGIN_SRC python :session
def fc(x):
    return (x**3 + 2*x + 3)%7
# 2, 3, 6
# 0, 1, 6

for i in range(7):
    fc(i)

pts = [(6,0),(2,1),(2,-1),(3,1),(3,-1)]
[[add(pt1, pt2, (2, 3), 7) for pt2 in pts] for pt1 in pts]

#+END_SRC

#+RESULTS:
| None  | (3 1) | (3 6) | (2 1) | (2 6) |
| (3 1) | (3 6) | None  | (2 6) | (6 0) |
| (3 6) | None  | (3 1) | (6 0) | (2 1) |
| (2 1) | (2 6) | (6 0) | (3 6) | None  |
| (2 6) | (6 0) | (2 1) | None  | (3 1) |

#+BEGIN_SRC python :session
pt1 = (4, 2)
pt2 = (0, 1)
curve = (1, 1)

[[i, ec_exp(pt1, i, curve, 5)] for i in range(9)]

#+END_SRC

#+RESULTS:
| 0 | None  |
| 1 | (4 2) |
| 2 | (3 4) |
| 3 | (2 4) |
| 4 | (0 4) |
| 5 | (0 1) |
| 6 | (2 1) |
| 7 | (3 1) |
| 8 | (4 3) |

#+BEGIN_SRC python :session
def ec_exp2(pt, n, curve, p):
    q = pt
    r = None
    res = []
    while n>0:
        if (n % 2) == 1:
            r = add(r, q, curve, p)
        q = add(q, q, curve, p)
        n = n>>1
        res.append((n,r))
    return res
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session
pt = (1756, 348)
n = 11
curve = (1828, 1675)
p = 1999
ec_exp(pt, n, curve, p) # (1068, 1540)
ec_exp2(pt, n, curve, p)

#+END_SRC

#+RESULTS:
| 5 | (1756 348)  |
| 2 | (1362 998)  |
| 1 | (1362 998)  |
| 0 | (1068 1540) |

